In [1]:
import pandas as pd
import numpy as np

In [10]:
df_1 = pd.read_csv("meter_data.csv")
df_2 = pd.read_csv("customer_data.csv")

In [11]:
df_1

,datetime,meter_id,location,daily_consumption_load,energy_supplied,energy_billed
0,01-01-2021 00:00,ACE43B7D,Chennai,2.59,2.78,2.57
1,01-01-2021 00:15,ACE43B7D,Chennai,1.78,2.12,1.86
2,01-01-2021 00:30,ACE43B7D,Chennai,2.59,2.68,2.52
3,01-01-2021 00:45,ACE43B7D,Chennai,2.45,2.56,2.50
4,01-01-2021 01:00,ACE43B7D,Chennai,1.48,1.56,1.49

In [12]:
df_2

   customer_id     name  meter_id   location  mobile_no
0            1     Uday  ACE43B7D      Delhi      11111
1            2   Gaurav  0653DAA9  Bengaluru      22222
2            3    Milan  344684B5    Kolkata      33333
3            4  Shubham  3F42A75F     Mumbai      44443

In [13]:
df_1_1 = df_1.drop(columns=["energy_supplied"], errors="ignore")

# Full outer join on meter_id
df_3 = pd.merge(  
    df_1_1,
    df_2,
    on="meter_id",
    how="inner"
)

print("Merged Data:")
print(df_3.head())

Merged Data:
           datetime  meter_id location_x  daily_consumption_load  \
0  01-01-2021 00:00  ACE43B7D    Chennai                    2.59
1  01-01-2021 00:15  ACE43B7D    Chennai                    1.78
2  01-01-2021 00:30  ACE43B7D    Chennai                    2.59
3  01-01-2021 00:45  ACE43B7D    Chennai                    2.45
4  01-01-2021 01:00  ACE43B7D    Chennai                    1.48

   energy_billed  customer_id  name location_y  mobile_no
0           2.57            1  Uday      Delhi      11111
1           1.86            1  Uday      Delhi      11111
2           2.52            1  Uday      Delhi      11111
3           2.50            1  Uday      Delhi      11111
4           1.49            1  Uday      Delhi      11111

In [14]:
df_3

,datetime,meter_id,location_x,daily_consumption_load,energy_billed,customer_id,name,location_y,mobile_no
0,01-01-2021 00:00,ACE43B7D,Chennai,2.59,2.57,1,Uday,Delhi,11111
1,01-01-2021 00:15,ACE43B7D,Chennai,1.78,1.86,1,Uday,Delhi,11111
2,01-01-2021 00:30,ACE43B7D,Chennai,2.59,2.52,1,Uday,Delhi,11111
3,01-01-2021 00:45,ACE43B7D,Chennai,2.45,2.50,1,Uday,Delhi,11111
4,01-01-2021 01:00,ACE43B7D,Chennai,1.48,1.49,1,Uday,Delhi,11111